jsonVaporClientWrk2V4.txt
Running 5m test @ http://169.254.140.128:8080/jsonShortVapor
  2 threads and 100 connections
  Thread calibration: mean lat.: 2.713ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.743ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.70ms  696.83us   5.62ms   68.79%
    Req/Sec    38.78     84.05   333.00     83.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.66ms
 75.000%    3.13ms
 90.000%    3.63ms
 99.000%    4.43ms
 99.900%    5.06ms
 99.990%    5.60ms
 99.999%    5.63ms
100.000%    5.63ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.675     0.000000            1         1.00
       1.838     0.100000         1851         1.11
       2.105     0.200000         3705         1.25
       2.305     0.300000         5564         1.43
       2.493     0.400000         7399         1.67
       2.659     0.500000         9269         2.00
       2.743     0.550000        10186         2.22
       2.837     0.600000        11108         2.50
       2.927     0.650000        12026         2.86
       3.023     0.700000        12952         3.33
       3.129     0.750000        13876         4.00
       3.195     0.775000        14343         4.44
       3.263     0.800000        14797         5.00
       3.337     0.825000        15268         5.71
       3.421     0.850000        15724         6.67
       3.525     0.875000        16200         8.00
       3.571     0.887500        16427         8.89
       3.631     0.900000        16653        10.00
       3.691     0.912500        16881        11.43
       3.761     0.925000        17109        13.33
       3.839     0.937500        17344        16.00
       3.877     0.943750        17460        17.78
       3.931     0.950000        17578        20.00
       3.979     0.956250        17691        22.86
       4.027     0.962500        17803        26.67
       4.093     0.968750        17919        32.00
       4.131     0.971875        17980        35.56
       4.163     0.975000        18037        40.00
       4.195     0.978125        18094        45.71
       4.247     0.981250        18159        53.33
       4.299     0.984375        18210        64.00
       4.331     0.985938        18240        71.11
       4.363     0.987500        18265        80.00
       4.399     0.989062        18294        91.43
       4.455     0.990625        18326       106.67
       4.499     0.992188        18352       128.00
       4.523     0.992969        18367       142.22
       4.547     0.993750        18383       160.00
       4.587     0.994531        18396       182.86
       4.651     0.995313        18411       213.33
       4.691     0.996094        18424       256.00
       4.739     0.996484        18431       284.44
       4.779     0.996875        18440       320.00
       4.803     0.997266        18446       365.71
       4.815     0.997656        18453       426.67
       4.879     0.998047        18461       512.00
       4.891     0.998242        18464       568.89
       4.919     0.998437        18468       640.00
       4.943     0.998633        18471       731.43
       5.039     0.998828        18475       853.33
       5.059     0.999023        18478      1024.00
       5.067     0.999121        18480      1137.78
       5.135     0.999219        18482      1280.00
       5.175     0.999316        18484      1462.86
       5.219     0.999414        18486      1706.67
       5.307     0.999512        18487      2048.00
       5.323     0.999561        18488      2275.56
       5.327     0.999609        18489      2560.00
       5.367     0.999658        18490      2925.71
       5.423     0.999707        18491      3413.33
       5.443     0.999756        18492      4096.00
       5.443     0.999780        18492      4551.11
       5.583     0.999805        18493      5120.00
       5.583     0.999829        18493      5851.43
       5.603     0.999854        18494      6826.67
       5.603     0.999878        18494      8192.00
       5.603     0.999890        18494      9102.22
       5.607     0.999902        18495     10240.00
       5.607     0.999915        18495     11702.86
       5.607     0.999927        18495     13653.33
       5.607     0.999939        18495     16384.00
       5.607     0.999945        18495     18204.44
       5.627     0.999951        18496     20480.00
       5.627     1.000000        18496          inf
#[Mean    =        2.696, StdDeviation   =        0.697]
#[Max     =        5.624, Total count    =        18496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  19202 requests in 5.00m, 2.98MB read
  Socket errors: connect 0, read 0, write 0, timeout 5364
Requests/sec:     64.01
Transfer/sec:     10.19KB