stressKituraClientWrk2V2.txt
Running 5m test @ http://169.254.140.128:8080/plaintextKitura
  2 threads and 500 connections
  Thread calibration: mean lat.: 14.764ms, rate sampling interval: 36ms
  Thread calibration: mean lat.: 14.799ms, rate sampling interval: 36ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.31ms    3.18ms  35.26ms   73.31%
    Req/Sec   261.57    838.83     3.60k    91.29%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.26ms
 75.000%   15.30ms
 90.000%   17.09ms
 99.000%   20.85ms
 99.900%   30.50ms
 99.990%   34.14ms
 99.999%   35.23ms
100.000%   35.29ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.895     0.000000            1         1.00
       9.775     0.100000        14530         1.11
      10.959     0.200000        29016         1.25
      11.807     0.300000        43492         1.43
      12.551     0.400000        57970         1.67
      13.255     0.500000        72451         2.00
      13.615     0.550000        79663         2.22
      13.999     0.600000        87021         2.50
      14.399     0.650000        94251         2.86
      14.823     0.700000       101404         3.33
      15.295     0.750000       108640         4.00
      15.559     0.775000       112336         4.44
      15.823     0.800000       115897         5.00
      16.111     0.825000       119520         5.71
      16.415     0.850000       123159         6.67
      16.735     0.875000       126772         8.00
      16.911     0.887500       128673         8.89
      17.087     0.900000       130432        10.00
      17.279     0.912500       132192        11.43
      17.503     0.925000       134023        13.33
      17.759     0.937500       135846        16.00
      17.903     0.943750       136722        17.78
      18.079     0.950000       137633        20.00
      18.287     0.956250       138518        22.86
      18.543     0.962500       139417        26.67
      18.863     0.968750       140329        32.00
      19.039     0.971875       140778        35.56
      19.263     0.975000       141236        40.00
      19.487     0.978125       141676        45.71
      19.775     0.981250       142146        53.33
      20.079     0.984375       142566        64.00
      20.271     0.985938       142809        71.11
      20.479     0.987500       143026        80.00
      20.703     0.989062       143256        91.43
      20.975     0.990625       143482       106.67
      21.295     0.992188       143707       128.00
      21.455     0.992969       143810       142.22
      21.711     0.993750       143926       160.00
      22.031     0.994531       144037       182.86
      22.447     0.995313       144153       213.33
      23.199     0.996094       144264       256.00
      23.775     0.996484       144319       284.44
      24.495     0.996875       144376       320.00
      25.743     0.997266       144431       365.71
      26.735     0.997656       144489       426.67
      27.791     0.998047       144546       512.00
      28.207     0.998242       144573       568.89
      28.911     0.998437       144601       640.00
      29.535     0.998633       144630       731.43
      30.095     0.998828       144658       853.33
      30.511     0.999023       144686      1024.00
      30.895     0.999121       144700      1137.78
      31.551     0.999219       144714      1280.00
      31.871     0.999316       144728      1462.86
      32.303     0.999414       144743      1706.67
      32.719     0.999512       144757      2048.00
      32.799     0.999561       144766      2275.56
      32.863     0.999609       144772      2560.00
      33.183     0.999658       144780      2925.71
      33.343     0.999707       144785      3413.33
      33.471     0.999756       144792      4096.00
      33.599     0.999780       144796      4551.11
      33.727     0.999805       144800      5120.00
      33.887     0.999829       144805      5851.43
      33.919     0.999854       144806      6826.67
      34.079     0.999878       144811      8192.00
      34.111     0.999890       144812      9102.22
      34.143     0.999902       144813     10240.00
      34.207     0.999915       144815     11702.86
      34.495     0.999927       144818     13653.33
      34.591     0.999939       144819     16384.00
      34.655     0.999945       144821     18204.44
      34.655     0.999951       144821     20480.00
      34.655     0.999957       144821     23405.71
      34.815     0.999963       144822     27306.67
      34.943     0.999969       144823     32768.00
      35.039     0.999973       144824     36408.89
      35.039     0.999976       144824     40960.00
      35.039     0.999979       144824     46811.43
      35.167     0.999982       144825     54613.33
      35.167     0.999985       144825     65536.00
      35.231     0.999986       144826     72817.78
      35.231     0.999988       144826     81920.00
      35.231     0.999989       144826     93622.86
      35.231     0.999991       144826    109226.67
      35.231     0.999992       144826    131072.00
      35.295     0.999993       144827    145635.56
      35.295     1.000000       144827          inf
#[Mean    =       13.307, StdDeviation   =        3.179]
#[Max     =       35.264, Total count    =       144827]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  150100 requests in 5.00m, 103.58MB read
  Socket errors: connect 249, read 318, write 9, timeout 37101
Requests/sec:    500.30
Transfer/sec:    353.54KB